<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;
class TableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
       
        DB::table('executive') -> insert([
            [
                '姓名' => '郭帛霖',
                '身分證字號' => 'B153276316',
                '職等' => '行政三級',
                '負責區域' => '北區',
                '薪資' => '90000',
                '電話' => '+8860973207386',
                '性別' => '男性',
                '生日' => '2000-07-28',
                '開始任職日期' => '2003-09-27',
                '住址' => '台中市西屯區台灣大道四段1727號',
                '照片路徑' => 'img'
            ],
            [
                '姓名' => '吳宗勳',
                '身分證字號' => 'A100148088',
                '職等' => '行政一級',
                '負責區域' => '南區',
                '薪資' => '22000',
                '電話' => '+8860973207996',
                '性別' => '男性',
                '生日' => '2000-05-28',
                '開始任職日期' => '2003-09-27',
                '住址' => '台中市西屯區台灣大道四段1727號',
                '照片路徑' => 'img'
            ],
            [
                '姓名' => '黃炎輝',
                '身分證字號' => 'D186742710',
                '職等' => '行政三級',
                '負責區域' => '北區',
                '薪資' => '90000',
                '電話' => '+8860973207386',
                '性別' => '男性',
                '生日' => '2000-07-28',
                '開始任職日期' => '2003-09-27',
                '住址' => '台中市西屯區台灣大道四段1727號',
                '照片路徑' => 'img'
            ],

        ]);

        DB::table('cared_family') -> insert([
            [
                '家庭代碼' => '北0000000',
                '受照護者姓名' => '包綠佐',
                '受照護者性別' => '女性',
                '受照護者生日' => '1982-08-21',
                '受照護者家庭住址' => '台中市西屯區台灣大道四段1727號',
                '受照護者身體狀態' => '憂鬱症這個疾病的病名，聽起來給人的第一印象是『心情不好的心理疾病』，情緒低落、容易哭泣確實是憂鬱症的一個重要症狀，但是憂鬱症影響所及絕對不是只是『心情不好』而已。根據憂鬱症的診斷定義，憂鬱症至少可能還包含有睡眠的改變 (幾乎每天失眠或嗜睡)、食慾的改變(明顯食慾變差或增加)、幾乎每天覺得疲累等身體症狀。臨床上，常見的憂鬱身體症狀還包括：胸悶、心悸、腸胃不適、肌肉緊繃或酸痛、骨頭關節酸痛、頭痛、背痛、胸痛、頭暈等症狀。當然，並不是每位憂鬱症患者都有上述的身體症狀，有些患者可能只有少數症狀，但有部份身體症狀很多的憂鬱症患者會以為自己身體生病了，而多次求診內科醫師或做身體檢查，但卻找不到有明顯的內科疾病可以完全解釋身體不舒服的狀況。從這個角度來看，憂鬱有一種全身是病的感覺但又找不到明顯的病因。有部份憂鬱患者會將心情的憂鬱歸因於身體的諸多不適，相反的，有些醫療人員或家屬可能會將患者的身體不適歸因於心理作用而否定患者的不舒服，以致患者覺得無法獲得體諒，因而情緒更糟。',
                '障礙別' => '輕度障礙',
                '聯絡人姓名' => '黃靜宏',
                '連絡電話' => '+8860912578663',
                'Line ID' => 'ryan45758'
            ],
            [
                '家庭代碼' => '北0000001',
                '受照護者姓名' => '林秀苓',
                '受照護者性別' => '女性',
                '受照護者生日' => '2001-08-21',
                '受照護者家庭住址' => '台中市西屯區台灣大道四段1727號',
                '受照護者身體狀態' => '過去文獻顯示，憂鬱與疼痛有明顯相關，在不同的疼痛當中，頭痛算是最常見的疼痛之一。在一個歐洲的流行病學調查中，頭痛在五種憂鬱症的慢性疼痛中(頭痛、背痛、四肢痛、關節痛、腸胃道疾病)名列前矛(1)。另外有研究顯示，頭痛、骨骼肌肉症狀、頭暈是憂鬱三個常見的身體症狀，約60%的憂鬱患者，有頭痛的困擾(2)，且當憂鬱症狀加劇時頭痛通常也會跟著變嚴重。事實上，身體的其它疼痛也常隨著憂鬱變嚴重而加劇。在頭痛與憂鬱的關係調查中顯示，頭痛頻率愈高、頭痛存在時間愈久，患者可能有憂鬱的危險性升高(3)；國內榮總王署君教授研究老年憂鬱與頭痛的關聯性，研究顯示：個案一生當中如果有比較嚴重的頭痛、偏頭痛，在老年時有比較高的機率會有憂鬱(4)。在神經科慢性頭痛的患者約有一半合併有憂鬱疾患(5)。因此，經常頭痛可能是憂鬱的另一種表徵，在治療患者時，如果患者經常有頭痛不要忘了去詢問憂鬱症狀。',
                '障礙別' => '重度障礙',
                '聯絡人姓名' => '黃靜宏',
                '連絡電話' => '+8860912578663',
                'Line ID' => 'ryan45757'
            ],
            [
                '家庭代碼' => '北0000002',
                '受照護者姓名' => '林建廷',
                '受照護者性別' => '女性',
                '受照護者生日' => '1944-08-21',
                '受照護者家庭住址' => '台中市西屯區台灣大道四段1727號',
                '受照護者身體狀態' => '憂鬱症不是單純的『心情不好』，憂鬱是腦部的生理疾病以心理、情緒症狀來表現，同時伴隨身體症狀，其影響所及還包括身體的多重系統，如：自律神經、內分泌、免疫、疼痛感覺等系統，因此憂鬱就如同其它內科疾病一樣，生病並不是意志薄弱或人格有問題。憂鬱對人類生活品質及功能的影響並不亞於常見的內科疾病，正確的診斷能避免患者到處看醫生檢查，早日發現及治療能避免憂鬱慢性化、降低自殺危險、改善生活品質，而正確的診斷憂鬱則有賴於醫療人員及大眾對憂鬱的了解與警覺。',
                '障礙別' => '重度障礙',
                '聯絡人姓名' => '黃靜宏',
                '連絡電話' => '+8860912578663',
                'Line ID' => 'ryan4575'
            ],
            [
                '家庭代碼' => '南0000003',
                '受照護者姓名' => '黃馨慧',
                '受照護者性別' => '女性',
                '受照護者生日' => '1997-08-21',
                '受照護者家庭住址' => '台中市西屯區台灣大道四段1727號',
                '受照護者身體狀態' => '5.眼睛血管粗大：根據美國杜克大學針對38歲的受測者所作的研究，視網膜內血管較粗大的人，智力測驗的成績低於血管較細小的人。換句話說，視網膜血管若變得粗大，很可能代表大腦的健康發生了變化。當然，一般人無法觀察到自己眼睛血管的變化，必須請眼科醫師進行仔細檢查。（上班族最常見4大眼睛問題，如何保養？）',
                '障礙別' => '重度障礙',
                '聯絡人姓名' => '黃靜宏',
                '連絡電話' => '+8860912578663',
                'Line ID' => 'ryan4575'
            ],
            [
                '家庭代碼' => '北0000004',
                '受照護者姓名' => '李宜柏',
                '受照護者性別' => '女性',
                '受照護者生日' => '1997-08-21',
                '受照護者家庭住址' => '台中市西屯區台灣大道四段1727號',
                '受照護者身體狀態' => '7.嗅覺變差：嗅覺功能減弱，很可能是阿茲海默症的前期徵兆。根據研究，體內澱粉樣蛋白前驅蛋白（與阿茲海默症的形成有關）較高的老鼠，鼻內神經細胞壞死的比例也較高。因此，如果年紀很輕嗅覺便突然出現衰退，就得要留意了。',
                '障礙別' => '重度障礙',
                '聯絡人姓名' => '黃靜宏',
                '連絡電話' => '+8860912578663',
                'Line ID' => 'ryan4575'
            ],
        ]);

        DB::table('carers') -> insert([
            [
                '照護人員ID' => 'K164545099',
                '照護人員姓名' => '陳淑美',
                '國籍' => '台灣',
                '照護人員性別' => '女性',
                '薪資' => '21200',
                '電話' => '+8860905872445',
                '照護人員生日' => '1987-05-26',
                '到職日期' => '2022-05-21',
                '長照人力公司合約到期日' => '2021-01-12'
            ],
            [
                '照護人員ID' => 'M170829918',
                '照護人員姓名' => '鄭綺婷',
                '國籍' => '台灣',
                '照護人員性別' => '女性',
                '薪資' => '37000',
                '電話' => '+8860905876635',
                '照護人員生日' => '1987-05-26',
                '到職日期' => '2022-05-21',
                '長照人力公司合約到期日' => '2025-07-12'
            ],
            [
                '照護人員ID' => 'T108060032',
                '照護人員姓名' => '李為汝',
                '國籍' => '台灣',
                '照護人員性別' => '女性',
                '薪資' => '21200',
                '電話' => '+8860905872445',
                '照護人員生日' => '1963-05-26',
                '到職日期' => '2022-05-25',
                '長照人力公司合約到期日' => '2023-01-12'
            ],
            [
                '照護人員ID' => 'X137573086',
                '照護人員姓名' => '楊侑穎',
                '國籍' => '台灣',
                '照護人員性別' => '女性',
                '薪資' => '21200',
                '電話' => '+886905872445',
                '照護人員生日' => '1955-05-31',
                '到職日期' => '2021-05-21',
                '長照人力公司合約到期日' => '2025-08-12'
            ],
            [
                '照護人員ID' => 'Y113965181',
                '照護人員姓名' => '李世凌',
                '國籍' => '台灣',
                '照護人員性別' => '女性',
                '薪資' => '21200',
                '電話' => '+886905872445',
                '照護人員生日' => '1963-01-26',
                '到職日期' => '2022-05-21',
                '長照人力公司合約到期日' => '2024-07-12'
            ],
        ]);

        DB::table('care_station') -> insert([
            [
                '照護人員ID' => 'K164545099',
                '派駐家庭代碼' => '北0000000',
                '照護人員姓名' => '陳淑美',
                '受照護者姓名' => '包綠佐',
                '派駐開始日期' => '2020-12-18',
                '派駐結束日期' => '2022-03-28'
            ],
            [
                '照護人員ID' => 'M170829918',
                '派駐家庭代碼' => '北0000000',
                '照護人員姓名' => '鄭綺婷',
                '受照護者姓名' => '包綠佐',
                '派駐開始日期' => '2019-12-18',
                '派駐結束日期' => '2022-07-28'
            ],
            [
                '照護人員ID' => 'T108060032',
                '派駐家庭代碼' => '北0000002',
                '照護人員姓名' => '李為汝',
                '受照護者姓名' => '林建廷',
                '派駐開始日期' => '2020-11-18',
                '派駐結束日期' => '2025-04-28'
            ],
        ]);
    }
}
